*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot



Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Спрощена/Допорогова закупівля

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Відкриті торги

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Відкриті торги з публікацією англійською мовою

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Переговорна процедура

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Переговорна процедура (скорочена)

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Переговорна процедура для потреб оборони

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Конкурентний діалог 1-ий етап

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Конкурентний діалог 2-ий етап

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Конкурентний діалог з публікацією англійською мовою 1-ий етап

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Конкурентний діалог з публікацією англійською мовою 2-ий етап

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Відкриті торги для закупівлі енергосервісу

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Закупівля без використання електронної системи

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Укладання рамкової угоди

Перейти на вкладку Вид закупівлі
    Обрати тип закупівлі    Відбір для закупівлі за рамковою угодою