*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot



Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Перейти на вкладку Регіон
    Вибір і перехід по регіонам    місто Севастополь

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    місто Київ

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Київська область

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Луганська область

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Полтавська область

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Житомирська область

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Волинська область

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Пропозиції роглянуті

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Завершена

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Торги відмінено

Перейти на вкладку Регіон
    Вибір і перехід по регіонам    Торги не відбулися
