*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot



Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Перейти на вкладку Статус
    Вибір і перехід по статусам    Період уточнень

Перейти на вкладку Статус
    Вибір і перехід по статусам    Подання пропозицій

Перейти на вкладку Статус
    Вибір і перехід по статусам    Прекваліфікація

Перейти на вкладку Статус
    Вибір і перехід по статусам    Прекваліфікація (період оскарження)

Перейти на вкладку Статус
    Вибір і перехід по статусам    Аукціон

Перейти на вкладку Статус
    Вибір і перехід по статусам    Кваліфікація переможця

Перейти на вкладку Статус
    Вибір і перехід по статусам    Кваліфікація переможця (період оскарження)

Перейти на вкладку Статус
    Вибір і перехід по статусам    Пропозиції роглянуті

Перейти на вкладку Статус
    Вибір і перехід по статусам    Завершена

Перейти на вкладку Статус
    Вибір і перехід по статусам    Торги відмінено

Перейти на вкладку Статус
    Вибір і перехід по статусам    Торги не відбулися






