*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot




Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Вибір статусу і порівняння результата в пошуці Період уточнень
    [Documentation]    Статус "Період уточнень" перехід по урлу
    [Tags]   Період уточнень
    Пошук статусу по назві вибираємо вручну       Період уточнень
    Порівняння тексту фільтра     Період уточнень

Вибір статусу і порівняння результата в пошуці Подання пропозицій
    [Documentation]    Статус "Подання пропозицій" перехід по урлу
    [Tags]   Подання пропозицій
    Пошук статусу по назві вибираємо вручну       Подання пропозицій
    Порівняння тексту фільтра     Подання пропозицій

Вибір статусу і порівняння результата в пошуці Прекваліфікація
    [Documentation]    Статус "Прекваліфікація" перехід по урлу
    [Tags]   Прекваліфікація
    Пошук статусу по назві вибираємо вручну       Прекваліфікація
    Порівняння тексту фільтра     Прекваліфікація

Вибір статусу і порівняння результата в пошуці Прекваліфікація (період оскарження)
    [Documentation]    Статус "Прекваліфікація (період оскарження)" перехід по урлу
    [Tags]   Прекваліфікація (період оскарження)
    Пошук статусу по назві вибираємо вручну       Прекваліфікація (період оскарження)
    Порівняння тексту фільтра     Прекваліфікація (період оскарження)

Вібір статусу і порівняння результата в пошуці Аукціон
    [Documentation]    Статус "Аукціон" перехід по урлу
    [Tags]   Auction
    Пошук статусу по назві вибираємо вручну       Аукціон
    Порівняння тексту фільтра     Аукціон

#Вибір статусу і порівняння результата в видачі
#    [Documentation]    Статус "Аукціон"
#    [Tags]   Auction
#    ${url}=   Перехід на сторінку статусу по урлу    active.auction
#    Порівняння тексту фільтра статусу з текстом першого результату видачі    Аукціон

Вибір статусу і порівняння результата в пошуці Кваліфікація переможця
    [Documentation]    Статус "Кваліфікація переможця" перехід по урлу
    [Tags]   Кваліфікація переможця
    Пошук статусу по назві вибираємо вручну       Кваліфікація переможця
    Порівняння тексту фільтра     Кваліфікація переможця

Вибір статусу і порівняння результата в пошуці Кваліфікація переможця (період оскарження)
    [Documentation]    Статус "Кваліфікація переможця (період оскарження)" перехід по урлу
    [Tags]   Кваліфікація переможця (період оскарження)
    Пошук статусу по назві вибираємо вручну       Кваліфікація переможця (період оскарження)
    Порівняння тексту фільтра     Кваліфікація переможця (період оскарження)

Вибір статусу і порівняння результата в пошуці Пропозиції роглянуті
    [Documentation]    Статус "Пропозиції роглянуті" перехід по урлу
    [Tags]   Пропозиції роглянуті
    Пошук статусу по назві вибираємо вручну       Пропозиції роглянуті
    Порівняння тексту фільтра     Пропозиції роглянуті

Вибір статусу і порівняння результата в пошуці Завершена
    [Documentation]    Статус "Завершена" перехід по урлу
    [Tags]   Завершена
    Пошук статусу по назві вибираємо вручну       Завершена
    Порівняння тексту фільтра     Завершена

Вібір статусу і порівняння результата в пошуці Торги відмінено
    [Documentation]    Статус "Торги відмінено" перехід по урлу
    [Tags]   Торги відмінено
    Пошук статусу по назві вибираємо вручну       Торги відмінено
    Порівняння тексту фільтра     Торги відмінено

Вибір статусу і порівняння результата в пошуці Торги не відбулися
    [Documentation]    Статус "Торги не відбулися" перехід по урлу
    [Tags]   Торги не відбулися
    Пошук статусу по назві вибираємо вручну       Торги не відбулися
    Порівняння тексту фільтра     Торги не відбулися






