*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot
Resource   ../page_object/heder_menu/news_page.robot

Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***

Перейти на вкладку Будівництво
    Вибір категорії закупівель    Будівництво    Продукти переробки нафти та вугілля


##Перейти на вкладку Медицина
##    Вибір категорії закупівель    Медицина    Фармацевтична продукція
#     [Documentation]    Перейти на вкладку Медицина
#     [Tags]    category
##
##Перейти на вкладку Меблі
##    Вибір категорії закупівель    Меблі    Офісні меблі
#     [Documentation]    Перейти на вкладку Меблі
#     [Tags]    category
##
##Перейти на вкладку Канцелярія та госптовари
##    Вибір категорії закупівель    Канцелярія та госптовари   Офісне приладдя та канцелярія
#     [Documentation]    Канцелярія та госптовари
#     [Tags]    category
##
##Перейти на вкладку Транспорт та запчастини
##    Вибір категорії закупівель    Транспорт та запчастини    Легкові автомобілі
#     [Documentation]    Транспорт та запчастини
#     [Tags]    category
##
##Перейти на вкладку Енергетика, нафтопродукти та паливо
##    Вибір категорії закупівель    Енергетика, нафтопродукти та паливо     Тверде паливо
#     [Documentation]    Енергетика, нафтопродукти та паливо
#     [Tags]    category
##
##Перейти на вкладку Метали
##    Вибір категорії закупівель    Метали     Металеві руди та сплави
#     [Documentation]    Метали
#     [Tags]    category
##
###Перейти на вкладку Одяг, взуття та текстиль
##    #Вибір категорії закупівель    Одяг, взуття та текстиль     Одяг
#     [Documentation]    Одяг, взуття та текстиль
#     [Tags]    category
##
##Перейти на вкладку Промислове обладнання та прилади
##    Вибір категорії закупівель    Промислове обладнання та прилади     Сонячна енергія
#     [Documentation]    Промислове обладнання та прилади
#     [Tags]    category
##
##Перейти на вкладку Харчування
##    Вибір категорії закупівель    Харчування     Молочні продукти
#     [Documentation]    Харчування
#     [Tags]    category
##
