*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot
Resource   ../page_object/news_page.robot

Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Перейти на вкладку Новин
    Вибір і перехід по верхньому меню    Новини
    Очікувваний результат Новин на сторінці
    ${url}=     get location
    log to console    ${url}
    ${1233}=     Url страницы
    log to console    ${1233}
Перейти на вкладку Події
    Вибір і перехід по верхньому меню    Події

Перейти на вкладку Prozorro Market
    Вибір і перехід по верхньому меню    Prozorro Market

Перейти на вкладку Інфобокс
    Вибір і перехід по верхньому меню    Інфобокс

Перейти на вкладку Калькулятор вартості газу
    Вибір і перехід по верхньому меню    Калькулятор вартості газу

Перейти на вкладку Творча Спілка
    Вибір і перехід по верхньому меню    Творча Спілка

*** Test Cases ***
Вибір і перехід по нижньому меню
    Вибір і перехід по нижньому меню    ПРОЗОРРО
    Очікувваний результат Новин на сторінці
   ${url}=     get location
    log to console    ${url}
    ${1233}=     Url страницы
    log to console    ${1233}
Перейти на вкладку Про нас
    Вибір і перехід по нижньому меню    Про нас

Перейти на вкладку Bug bounty
    Вибір і перехід по нижньому меню    Bug bounty

Перейти на вкладку Інформаційна безпека
    Вибір і перехід по нижньому меню    Інформаційна безпека

Перейти на вкладку Документи ДП "ПРОЗОРРО"
    Вибір і перехід по нижньому меню    Документи ДП "ПРОЗОРРО"

Перейти на вкладку Подати офіційний лист з ЕЦП
    Вибір і перехід по нижньому меню    Подати офіційний лист з ЕЦП

Перейти на вкладку Розвиток системи
    Вибір і перехід по нижньому меню    Розвиток системи

Перейти на вкладку Майданчики Prozorro
    Вибір і перехід по нижньому меню    Майданчики Prozorro


