*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot



Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Спрощена/Допорогова закупівля

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Відкриті торги

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Відкриті торги з публікацією англійською мовою

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Переговорна процедура

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Переговорна процедура (скорочена)

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Переговорна процедура для потреб оборони

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Конкурентний діалог 1-ий етап

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Конкурентний діалог 2-ий етап

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Конкурентний діалог з публікацією англійською мовою 1-ий етап

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Конкурентний діалог з публікацією англійською мовою 2-ий етап

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Відкриті торги для закупівлі енергосервісу

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Закупівля без використання електронної системи

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Укладання рамкової угоди

Перейти на вкладку Вид закупівлі
    Обрати закупівлю по типу    Відбір для закупівлі за рамковою угодою