*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot
Resource   ../page_object/news_page.robot

Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***

Перейти на вкладку Будівництво
    Вибір категорії закупівель    Будівництво    Продукти переробки нафти та вугілля

Перейти на вкладку Медицина
    Вибір і перехід категорії    Медицина    Фармацевтична продукція

Перейти на вкладку Меблі
    Вибір і перехід категорії    Меблі    Офісні меблі

Перейти на вкладку Комп'ютерна техніка
    Вибір і перехід категорії    Комп'ютерна техніка    Офісна техніка

Перейти на вкладку Канцелярія та госптовари
    Вибір і перехід категорії    Канцелярія та госптовари    Офісне приладдя та канцелярія

Перейти на вкладку Транспорт та запчастини
    Вибір і перехід категорії    Транспорт та запчастини    Легкові автомобілі

Перейти на вкладку Енергетика, нафтопродукти та паливо
    Вибір і перехід категорії    Енергетика, нафтопродукти та паливо     Тверде паливо

Перейти на вкладку Метали
    Вибір і перехід категорії    Метали     Паливна деревина

Перейти на вкладку Комунальне та побутове обслуговування
    Вибір і перехід категорії    Комунальне та побутове обслуговування     Утилізація сміття

Перейти на вкладку Одяг, взуття та текстиль
    Вибір і перехід категорії    Одяг, взуття та текстиль     Одяг

Перейти на вкладку Промислове обладнання та прилади
    Вибір і перехід категорії    Промислове обладнання та прилади     Сонячна енергія

Перейти на вкладку Харчування
    Вибір і перехід категорії    Харчування     Молочні продукти

Перейти на вкладку Поліграфія
    Вибір і перехід категорії    Поліграфія     Періодичні видання

Перейти на вкладку Науково-дослідні роботи
    Вибір і перехід категорії    Науково-дослідні роботи     Науково-дослідні роботи

Перейти на вкладку Різні послуги та товари
    Вибір і перехід категорії     Різні послуги та товари     Товари для дозвілля