*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot




Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Вибір виду закупівлі і порівняння з заданим результатом Спрощена/Допорогова закупівля
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Спрощена/Допорогова закупівля
    [Tags]    belowThreshold
    Пошук типу закупівлі вибираємо вручну       Спрощена/Допорогова закупівля
    Порівняння тексту фільтра     Спрощена/Допорогова закупівля

Вибір виду закупівлі і порівняння з заданим результатом Відкриті торги
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Відкриті торги
    [Tags]    aboveThresholdUA
    Пошук типу закупівлі вибираємо вручну       Відкриті торги
    Порівняння тексту фільтра     Відкриті торги

Вибір виду закупівлі і порівняння з заданим результатом Відкриті торги з публікацією англійською мовою
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Відкриті торги з публікацією англійською мовою
    [Tags]    aboveThresholdEU
    Пошук типу закупівлі вибираємо вручну       Відкриті торги з публікацією англійською мовою
    Порівняння тексту фільтра     Відкриті торги з публікацією англійською мовою

Вибір виду закупівлі і порівняння з заданим результатом Переговорна процедура
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Переговорна процедура
    [Tags]    negotiation
    Пошук типу закупівлі вибираємо вручну       Переговорна процедура
    Порівняння тексту фільтра     Переговорна процедура

Вибір виду закупівлі і порівняння з заданим результатом Переговорна процедура (скорочена)
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Переговорна процедура (скорочена)
    [Tags]    negotiation.quick
    Пошук типу закупівлі вибираємо вручну       Переговорна процедура (скорочена)
    Порівняння тексту фільтра     Переговорна процедура (скорочена)

Вибір виду закупівлі і порівняння з заданим результатом Переговорна процедура для потреб оборони
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Переговорна процедура для потреб оборони
    [Tags]    aboveThresholdUA.defense
    Пошук типу закупівлі вибираємо вручну       Переговорна процедура для потреб оборони
    Порівняння тексту фільтра     Переговорна процедура для потреб оборони

Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог 1-ий етап
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог 1-ий етап
    [Tags]    competitiveDialogueUA
    Пошук типу закупівлі вибираємо вручну       Конкурентний діалог 1-ий етап
    Порівняння тексту фільтра     Конкурентний діалог 1-ий етап

Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог 2-ий етап
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог 2-ий етап
    [Tags]    competitiveDialogueUA.stage2
    Пошук типу закупівлі вибираємо вручну       Конкурентний діалог 2-ий етап
    Порівняння тексту фільтра     Конкурентний діалог 2-ий етап

Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог з публікацією англійською мовою 1-ий етап
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог з публікацією англійською мовою 1-ий етап
    [Tags]    competitiveDialogueEU
    Пошук типу закупівлі вибираємо вручну       Конкурентний діалог з публікацією англійською мовою 1-ий етап
    Порівняння тексту фільтра     Конкурентний діалог з публікацією англійською мовою 1-ий етап

Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог з публікацією англійською мовою 2-ий етап
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Конкурентний діалог з публікацією англійською мовою 2-ий етап
    [Tags]    competitiveDialogueEU
    Пошук типу закупівлі вибираємо вручну       Конкурентний діалог з публікацією англійською мовою 2-ий етап
    Порівняння тексту фільтра     Конкурентний діалог з публікацією англійською мовою 2-ий етап

Вибір виду закупівлі і порівняння з заданим результатом Відкриті торги для закупівлі енергосервісу
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Відкриті торги для закупівлі енергосервісу
    [Tags]    esco
    Пошук типу закупівлі вибираємо вручну       Відкриті торги для закупівлі енергосервісу
    Порівняння тексту фільтра     Відкриті торги для закупівлі енергосервісу

Вибір виду закупівлі і порівняння з заданим результатом Закупівля без використання електронної системи
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Закупівля без використання електронної системи
    [Tags]    reporting
    Пошук типу закупівлі вибираємо вручну       Закупівля без використання електронної системи
    Порівняння тексту фільтра     Закупівля без використання електронної системи

Вибір виду закупівлі і порівняння з заданим результатом Укладання рамкової угоди
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Укладання рамкової угоди
    [Tags]    closeFrameworkAgreementUA
    Пошук типу закупівлі вибираємо вручну       Укладання рамкової угоди
    Порівняння тексту фільтра     Укладання рамкової угоди

Вибір виду закупівлі і порівняння з заданим результатом Відбір для закупівлі за рамковою угодою
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Відбір для закупівлі за рамковою угодою
    [Tags]    closeFrameworkAgreementSelectionUA
    Пошук типу закупівлі вибираємо вручну       Відбір для закупівлі за рамковою угодою
    Порівняння тексту фільтра     Відбір для закупівлі за рамковою угодою

Вибір виду закупівлі і порівняння з заданим результатом Спрощені торги із застосуванням електронної системи закупівель
    [Documentation]    Вибір виду закупівлі і порівняння з заданим результатом Спрощені торги із застосуванням електронної системи закупівель
    [Tags]    simple
    Пошук типу закупівлі вибираємо вручну       Спрощені торги із застосуванням електронної системи закупівель
    Порівняння тексту фільтра     Спрощені торги із застосуванням електронної системи закупівель


