*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot



Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Вибір статусу в блоці пошуку
    Пошук статусу по назві    Період уточнень

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Подання пропозицій

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Прекваліфікація

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Прекваліфікація (період оскарження)

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Аукціон

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Кваліфікація переможця

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Кваліфікація переможця (період оскарження)

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Пропозиції роглянуті

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Завершена

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Торги відмінено

Вибір статусу в блоці пошуку
    Пошук статусу по назві    Торги не відбулися






