*** Settings ***
Resource   /home/nesterpna/robot-scripts/portal/Resource/page_object/main.robot
Resource   /home/nesterpna/robot-scripts/portal/Resource/page_object/common.robot
Resource   /home/nesterpna/robot-scripts/portal/Resource/page_object/news_page.robot

Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Вибір і перехід по нижньому меню
    Вибір і перехід по нижньому меню    ПРОЗОРРО
    Очікувваний результат Новин на сторінці
   ${url}=     get location
    log to console    ${url}
    ${1233}=     Url страницы
    log to console    ${1233}
Перейти на вкладку Про нас
    Вибір і перехід по нижньому меню    Про нас

Перейти на вкладку Bug bounty
    Вибір і перехід по нижньому меню    Bug bounty

Перейти на вкладку Інформаційна безпека
    Вибір і перехід по нижньому меню    Інформаційна безпека

Перейти на вкладку Документи ДП "ПРОЗОРРО"
    Вибір і перехід по нижньому меню    Документи ДП "ПРОЗОРРО"

Перейти на вкладку Подати офіційний лист з ЕЦП
    Вибір і перехід по нижньому меню    Подати офіційний лист з ЕЦП

Перейти на вкладку Розвиток системи
    Вибір і перехід по нижньому меню    Розвиток системи

Перейти на вкладку Майданчики Prozorro
    Вибір і перехід по нижньому меню    Майданчики Prozorro

Перейти на вкладку Дозорро
    Вибір і перехід по нижньому меню    Дозорро

Перейти на вкладку Друзі Prozorro
    Вибір і перехід по нижньому меню    Друзі Prozorro

Перейти на вкладку Prozorro Market інструмент ЦЗО
    Вибір і перехід по нижньому меню    Prozorro Market інструмент ЦЗО

Перейти на вкладку Митці
    Вибір і перехід по нижньому меню    Митці

Перейти на вкладку Моніторинг
    Вибір і перехід по нижньому меню    Моніторинг

Перейти на вкладку Розробникам
    Вибір і перехід по нижньому меню    Розробникам

Перейти на вкладку Майданчикам
    Вибір і перехід по нижньому меню    Майданчикам

Перейти на вкладку Захист учасників
    Вибір і перехід по нижньому меню    Захист учасників

Перейти на вкладку Запитання та відповіді
    Вибір і перехід по нижньому меню    Запитання та відповіді