*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot




Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Вибір регіона в блоці пошуку
    Пошук регіона по назві    місто Севастополь
    #Перевірка сторінки після переходу    region    msg='некоректне посилання'
    #Очікувваний результат місто Севастополь відображається на сторінці

Вибір регіона в блоці пошуку
    Пошук регіона по назві    місто Київ

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Київська область

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Луганська область

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Полтавська область

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Житомирська область

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Волинська область

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Пропозиції роглянуті

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Завершена

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Торги відмінено

Вибір регіона в блоці пошуку
    Пошук регіона по назві    Торги не відбулися
