*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot




Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Вибір регіону і порівняння з заданим результатом місто Севастополь
    [Documentation]    місто Севастополь пошук по назві і порівняння з результатом
    [Tags]    місто Севастополь
    Пошук регіона по назві вибираємо вручну       місто Севастополь
    Порівняння тексту фільтра     місто Севастополь

#Вибір регіону і порівння при переході по урлу місто Севастополь
#    [Documentation]    Статус "Севастополь" перехід по урлу
#    [Tags]   99
#    Перехід на сторінку регіона по урлу    99
#    Порівняння тексту фільтра     місто Севастополь
##    Порівняння тексту фільтра статусу з текстом першого результату видачі    місто Севастополь
################################################################################################

#Вибір регіону і порівняння з заданим результатом місто Київ
#    [Documentation]    місто Київ пошук по назві і порівняння з результатом
#    [Tags]   Київ
#    Пошук регіона по назві вибираємо вручну       місто Київ
#    Порівняння тексту фільтра     місто Київ
#
#Вибір регіону і порівняння з заданим результатом Київська область
#    [Documentation]    Обрати Київська область пошук по назві і порівняння з результатом
#    [Tags]   Київська область
#    Пошук регіона по назві вибираємо вручну       Київська область
#    Порівняння тексту фільтра     Київська область
#
#Вибір регіону і порівняння з заданим результатом Луганська область
#    [Documentation]    Обрати Луганська область пошук по назві і порівняння з результатом
#    [Tags]   Луганська область
#    Пошук регіона по назві вибираємо вручну       Луганська область
#    Порівняння тексту фільтра     Луганська область
#
#Вибір регіону і порівняння з заданим результатом Полтавська область
#    [Documentation]    Обрати Полтавська область пошук по назві і порівняння з результатом
#    [Tags]   Полтавська область
#    Пошук регіона по назві вибираємо вручну       Полтавська область
#    Порівняння тексту фільтра     Полтавська область
#
#Вибір регіону і порівняння з заданим результатом Житомирська область
#    [Documentation]    Обрати Житомирська область пошук по назві і порівняння з результатом
#    [Tags]   Житомирська область
#    Пошук регіона по назві вибираємо вручну       Житомирська область
#    Порівняння тексту фільтра     Житомирська область
#
#Вибір регіону і порівняння з заданим результатом Волинська область
#    [Documentation]    Обрати Волинська область пошук по назві і порівняння з результатом
#    [Tags]   Волинська область
#    Пошук регіона по назві вибираємо вручну       Волинська область
#    Порівняння тексту фільтра     Волинська область
#
#Вибір регіону і порівняння з заданим результатом Львівська область
#    [Documentation]    Обрати Львівська область пошук по назві і порівняння з результатом
#    [Tags]   Львівська область
#    Пошук регіона по назві вибираємо вручну       Львівська область
#    Порівняння тексту фільтра     Львівська область
#
#Вибір регіону і порівняння з заданим результатом Чернівецька область
#    [Documentation]    Обрати Чернівецька область пошук по назві і порівняння з результатом
#    [Tags]   Чернівецька область
#    Пошук регіона по назві вибираємо вручну       Чернівецька область
#    Порівняння тексту фільтра     Чернівецька область
#
#Вибір регіону і порівняння з заданим результатом Донецька область
#    [Documentation]    Обрати Донецька область пошук по назві і порівняння з результатом
#    [Tags]   Донецька область
#    Пошук регіона по назві вибираємо вручну       Донецька область
#    Порівняння тексту фільтра     Донецька область
#
#Вибір регіону і порівняння з заданим результатом Черкаська область
#    [Documentation]    Обрати Черкаська область пошук по назві і порівняння з результатом
#    [Tags]   Черкаська область
#    Пошук регіона по назві вибираємо вручну       Черкаська область
#    Порівняння тексту фільтра     Черкаська область
#
#Вибір регіону і порівняння з заданим результатом Харківська область
#    [Documentation]    Обрати Харківська область пошук по назві і порівняння з результатом
#    [Tags]   Харківська область
#    Пошук регіона по назві вибираємо вручну       Харківська область
#    Порівняння тексту фільтра     Харківська область
#
#Вибір регіону і порівняння з заданим результатом Сумська область
#    [Documentation]    Обрати Сумська область пошук по назві і порівняння з результатом
#    [Tags]   Сумська область
#    Пошук регіона по назві вибираємо вручну       Сумська область
#    Порівняння тексту фільтра     Сумська область
#
#Вибір регіону і порівняння з заданим результатом Автономна Республіка Крим
#    [Documentation]    Обрати Автономна Республіка Крим пошук по назві і порівняння з результатом
#    [Tags]   Автономна Республіка Крим
#    Пошук регіона по назві вибираємо вручну       Автономна Республіка Крим
#    Порівняння тексту фільтра     Автономна Республіка Крим
#
#Вибір регіону і порівняння з заданим результатом Кіровоградська область
#    [Documentation]    Обрати Кіровоградська область пошук по назві і порівняння з результатом
#    [Tags]   Кіровоградська область
#    Пошук регіона по назві вибираємо вручну       Кіровоградська область
#    Порівняння тексту фільтра     Кіровоградська область
#
#Вибір регіону і порівняння з заданим результатом Хмельницька область
#    [Documentation]    Обрати Хмельницька область пошук по назві і порівняння з результатом
#    [Tags]   Хмельницька область
#    Пошук регіона по назві вибираємо вручну       Хмельницька область
#    Порівняння тексту фільтра     Хмельницька область
#
#Вибір регіону і порівняння з заданим результатом Одеська область
#    [Documentation]    Обрати Одеська область пошук по назві і порівняння з результатом
#    [Tags]   Одеська область
#    Пошук регіона по назві вибираємо вручну       Одеська область
#    Порівняння тексту фільтра     Одеська область
#
#Вибір регіону і порівняння з заданим результатом Чернігівська область
#    [Documentation]    Обрати Чернігівська область пошук по назві і порівняння з результатом
#    [Tags]   Чернігівська область
#    Пошук регіона по назві вибираємо вручну       Чернігівська область
#    Порівняння тексту фільтра     Чернігівська область
#
#Вибір регіону і порівняння з заданим результатом Тернопільська область
#    [Documentation]    Обрати Тернопільська область пошук по назві і порівняння з результатом
#    [Tags]   Тернопільська область
#    Пошук регіона по назві вибираємо вручну       Тернопільська область
#    Порівняння тексту фільтра     Тернопільська область
#
#Вибір регіону і порівняння з заданим результатом Івано-Франківська область
#    [Documentation]    Обрати Івано-Франківська область пошук по назві і порівняння з результатом
#    [Tags]   Івано-Франківська область
#    Пошук регіона по назві вибираємо вручну       Івано-Франківська область
#    Порівняння тексту фільтра     Івано-Франківська область
#
#Вибір регіону і порівняння з заданим результатом Херсонська область
#    [Documentation]    Обрати Херсонська область пошук по назві і порівняння з результатом
#    [Tags]   Херсонська область
#    Пошук регіона по назві вибираємо вручну       Херсонська область
#    Порівняння тексту фільтра     Херсонська область
#
#Вибір регіону і порівняння з заданим результатом Вінницька область
#    [Documentation]    Обрати Вінницька область пошук по назві і порівняння з результатом
#    [Tags]   Вінницька область
#    Пошук регіона по назві вибираємо вручну       Вінницька область
#    Порівняння тексту фільтра     Вінницька область
#
#Вибір регіону і порівняння з заданим результатом Миколаївська область
#    [Documentation]    Обрати Миколаївська область пошук по назві і порівняння з результатом
#    [Tags]   Миколаївська область
#    Пошук регіона по назві вибираємо вручну       Миколаївська область
#    Порівняння тексту фільтра     Миколаївська область
#
#Вибір регіону і порівняння з заданим результатом Рівненська область
#    [Documentation]    Обрати Рівненська область пошук по назві і порівняння з результатом
#    [Tags]   Рівненська область
#    Пошук регіона по назві вибираємо вручну       Рівненська область
#    Порівняння тексту фільтра     Рівненська область
#
#Вибір регіону і порівняння з заданим результатом Дніпропетровська область
#    [Documentation]    Обрати Дніпропетровська область пошук по назві і порівняння з результатом
#    [Tags]   Дніпропетровська область
#    Пошук регіона по назві вибираємо вручну       Дніпропетровська область
#    Порівняння тексту фільтра     Дніпропетровська область
#
#Вибір регіону і порівняння з заданим результатом Запорізька область
#    [Documentation]    Обрати Запорізька область пошук по назві і порівняння з результатом
#    [Tags]   Запорізька область
#    Пошук регіона по назві вибираємо вручну       Запорізька область
#    Порівняння тексту фільтра     Запорізька область
