*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot
Resource   ../page_object/news_page.robot

Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***

Перейти на вкладку Будівництво
    Вибір категорії закупівель    Будівництво    Продукти переробки нафти та вугілля


#Перейти на вкладку Медицина
    #Вибір і перехід категорії    Медицина

#Перейти на вкладку Меблі
    #Вибір і перехід категорії    Меблі

#Перейти на вкладку Комп'ютерна техніка
    #Вибір і перехід категорії    Комп'ютерна техніка

#Перейти на вкладку Транспорт та запчастини
    #Вибір і перехід категорії    Транспорт та запчастини

#Перейти на вкладку Транспорт та запчастини
    #Вибір і перехід категорії    Транспорт та запчастини