*** Settings ***
Resource   ../page_object/main.robot
Resource   ../page_object/common.robot




Test Setup       Start TestCase
Test Teardown    Finish TestCase


*** Test Cases ***
Вибір статусу і порівняння результата в пошуці Період уточнень
    [Documentation]    Статус "Період уточнень" перехід по пошуку
    [Tags]   Період уточнень
    Пошук статусу по назві вибираємо вручну       Період уточнень
    Порівняння тексту фільтра     Період уточнень

Вибір статусу і порівння при переході по урлу Період уточнень
    [Documentation]    Статус "Період уточнень" перехід по урлу
    [Tags]   Період уточнень
    Перехід на сторінку статусу по урлу    active.enquiries
    Порівняння тексту фільтра     Період уточнень
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Період уточнень
########################################################################################################

Вибір статусу і порівняння результата в пошуці Подання пропозицій
    [Documentation]    Статус "Подання пропозицій" перехід по пошуку
    [Tags]   Подання пропозицій
    Пошук статусу по назві вибираємо вручну       Подання пропозицій
    Порівняння тексту фільтра     Подання пропозицій

Вибір статусу і порівння при переході по урлу Подання пропозицій
    [Documentation]    Статус "Подання пропозицій" перехід по урлу
    [Tags]   Подання пропозицій
    Перехід на сторінку статусу по урлу    active.tendering
    Порівняння тексту фільтра     Подання пропозицій
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Подання пропозицій
########################################################################################################

Вибір статусу і порівняння результата в пошуці Прекваліфікація
    [Documentation]    Статус "Прекваліфікація" перехід по пошуку
    [Tags]   Прекваліфікація
    Пошук статусу по назві вибираємо вручну       Прекваліфікація
    Порівняння тексту фільтра     Прекваліфікація

Вибір статусу і порівння при переході по урлу Прекваліфікація
    [Documentation]    Статус "Прекваліфікація" перехід по урлу
    [Tags]   Прекваліфікація
    Перехід на сторінку статусу по урлу    active.pre-qualification
    Порівняння тексту фільтра     Прекваліфікація
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Прекваліфікація
########################################################################################################

Вибір статусу і порівняння результата в пошуці Прекваліфікація (період оскарження)
    [Documentation]    Статус "Прекваліфікація (період оскарження)" перехід по пошуку
    [Tags]   Прекваліфікація (період оскарження)
    Пошук статусу по назві вибираємо вручну       Прекваліфікація (період оскарження)
    Порівняння тексту фільтра     Прекваліфікація (період оскарження)

Вибір статусу і порівння при переході по урлу Прекваліфікація (період оскарження)
    [Documentation]    Статус "Прекваліфікація (період оскарження)" перехід по урлу
    [Tags]   "Прекваліфікація (період оскарження)"
    Перехід на сторінку статусу по урлу    active.pre-qualification.stand-still
    Порівняння тексту фільтра     Прекваліфікація (період оскарження)
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Прекваліфікація (період оскарження)
########################################################################################################

Вібір статусу і порівняння при виборі в статусі в ручну в пошуці Аукціон
    [Documentation]    Статус "Аукціон" перехід по пошуку
    [Tags]   Auction
    Пошук статусу по назві вибираємо вручну       Аукціон
    Порівняння тексту фільтра     Аукціон

Вибір статусу і порівння при переході по урлу Статус "Аукціон"
    [Documentation]    Статус "Аукціон"
    [Tags]   Auction
    Перехід на сторінку статусу по урлу    active.auction
    Порівняння тексту фільтра     Аукціон
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Аукціон
########################################################################################################

Вибір статусу і порівняння результата в пошуці Кваліфікація переможця
    [Documentation]    Статус "Кваліфікація переможця" перехід по пошуку
    [Tags]   Кваліфікація переможця
    Пошук статусу по назві вибираємо вручну       Кваліфікація переможця
    Порівняння тексту фільтра     Кваліфікація переможця

Вибір статусу і порівння при переході по урлу Кваліфікація переможця
    [Documentation]    Кваліфікація переможця
    [Tags]   Кваліфікація переможця
    Перехід на сторінку статусу по урлу    active.qualification
    Порівняння тексту фільтра     Кваліфікація переможця
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Кваліфікація переможця
########################################################################################################

Вибір статусу і порівняння результата в пошуці Кваліфікація переможця (період оскарження)
    [Documentation]    Статус "Кваліфікація переможця (період оскарження)" перехід по пошуку
    [Tags]   Кваліфікація переможця (період оскарження)
    Пошук статусу по назві вибираємо вручну       Кваліфікація переможця (період оскарження)
    Порівняння тексту фільтра     Кваліфікація переможця (період оскарження)

Вибір статусу і порівння при переході по урлу Кваліфікація переможця (період оскарження)
    [Documentation]    Кваліфікація переможця (період оскарження)
    [Tags]   Кваліфікація переможця (період оскарження)
    Перехід на сторінку статусу по урлу    active.qualification.stand-still
    Порівняння тексту фільтра     Кваліфікація переможця (період оскарження)
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Кваліфікація переможця (період оскарження)
########################################################################################################

Вибір статусу і порівняння результата в пошуці Пропозиції роглянуті
    [Documentation]    Статус "Пропозиції роглянуті" перехід по пошуку
    [Tags]   Пропозиції роглянуті
    Пошук статусу по назві вибираємо вручну       Пропозиції роглянуті
    Порівняння тексту фільтра     Пропозиції роглянуті

Вибір статусу і порівння при переході по урлу Пропозиції роглянуті
    [Documentation]    Пропозиції роглянуті
    [Tags]   Пропозиції роглянуті
    Перехід на сторінку статусу по урлу    active.awarded
    Порівняння тексту фільтра     Пропозиції роглянуті
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Пропозиції роглянуті
########################################################################################################

Вибір статусу і порівняння результата в пошуці Завершена
    [Documentation]    Статус "Завершена" перехід по пошуку
    [Tags]   Завершена
    Пошук статусу по назві вибираємо вручну       Завершена
    Порівняння тексту фільтра     Завершена

Вибір статусу і порівння при переході по урлу Завершена
    [Documentation]    Завершена
    [Tags]   Завершена
    Перехід на сторінку статусу по урлу    complete
    Порівняння тексту фільтра     Завершена
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Завершена
########################################################################################################

Вібір статусу і порівняння результата в пошуці Торги відмінено
    [Documentation]    Статус "Торги відмінено" перехід по пошуку
    [Tags]   Торги відмінено
    Пошук статусу по назві вибираємо вручну       Торги відмінено
    Порівняння тексту фільтра     Торги відмінено

Вибір статусу і порівння при переході по урлу Торги відмінено
    [Documentation]    Торги відмінено
    [Tags]   Торги відмінено
    Перехід на сторінку статусу по урлу    cancelled
    Порівняння тексту фільтра     Торги відмінено
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Торги відмінено
########################################################################################################

Вибір статусу і порівняння результата в пошуці Торги не відбулися
    [Documentation]    Статус "Торги не відбулися" перехід по пошуку
    [Tags]   Торги не відбулися
    Пошук статусу по назві вибираємо вручну       Торги не відбулися
    Порівняння тексту фільтра     Торги не відбулися

Вибір статусу і порівння при переході по урлу Торги не відбулися
    [Documentation]    Торги не відбулися
    [Tags]   Торги не відбулися
    Перехід на сторінку статусу по урлу    unsuccessful
    Порівняння тексту фільтра     Торги не відбулися
    Порівняння тексту фільтра статусу з текстом першого результату видачі    Торги не відбулися
########################################################################################################





